In [1]:
import pandas as pd

In [2]:
data1=pd.read_excel(r'C:\Users\Lenovo\Desktop\MyDat1.xlsx')

In [3]:
data1

      Name  Age  Salary
0   Aakash   35   15000
1     Deep   36   16000
2    Sunil   65  100000
3  Dominic   42   20000

In [4]:
data2=pd.read_csv(r'C:\Users\Lenovo\Desktop\MyDat2.csv')

In [5]:
data2

   Roll No    Name  Batch
0     1001  Sourav   1996
1     1002    Ajay   1992
2     1003  Sachin   1989
3     1004   Azhar   1984

In [6]:
data3=pd.read_csv(r'C:\Users\Lenovo\Desktop\MyDat3.tsv',sep='\t')

In [7]:
data3

   RollNo    Name  Batch
0    1101   Anand   1857
1    1102  Kishan   1867
2    1103  Rajesh   1897
3    1104  Mahesh   1900